In [1]:
import numpy as np
import pandas as pd

## Series

In [2]:
myDict = {"Atil" :50, "Zeynep" :40, "Mehmet" : 30}

In [5]:
pd.Series(myDict)

Atil      50
Zeynep    40
Mehmet    30
dtype: int64

In [6]:
myNames = ["Atil","Zeynep","Mehmet"]
myAges = [50,40,30]

In [8]:
pd.Series(index= myNames,data= myAges)

Atil      50
Zeynep    40
Mehmet    30
dtype: int64

# Data Frame

In [10]:
data = np.random.randn(4,3)

In [11]:
data

array([[-1.3400006 , -0.431062  ,  0.83177702],
       [-0.80690187, -0.67543298, -0.92450696],
       [ 1.22728582, -1.23117684, -0.14729701],
       [ 0.08956523, -1.27838569,  1.72716365]])

In [12]:
dataFrame = pd.DataFrame(data)

In [13]:
dataFrame

          0         1         2
0 -1.340001 -0.431062  0.831777
1 -0.806902 -0.675433 -0.924507
2  1.227286 -1.231177 -0.147297
3  0.089565 -1.278386  1.727164

In [19]:
dataFrame[0]  # return column

0   -1.340001
1   -0.806902
2    1.227286
3    0.089565
Name: 0, dtype: float64

In [20]:
newDataFrame = pd.DataFrame(data,index=["Atil","Zeynep","Atlas","Mehmet"],columns=["Salary","Age","Work_time"])

In [29]:
newDataFrame

          Salary       Age  Work_time
Atil   -1.340001 -0.431062   0.831777
Zeynep -0.806902 -0.675433  -0.924507
Atlas   1.227286 -1.231177  -0.147297
Mehmet  0.089565 -1.278386   1.727164

In [30]:
newDataFrame["Age"]

Atil     -0.431062
Zeynep   -0.675433
Atlas    -1.231177
Mehmet   -1.278386
Name: Age, dtype: float64

In [31]:
newDataFrame[["Salary","Age"]]

          Salary       Age
Atil   -1.340001 -0.431062
Zeynep -0.806902 -0.675433
Atlas   1.227286 -1.231177
Mehmet  0.089565 -1.278386

#### Selecting a row

In [32]:
newDataFrame.loc["Mehmet"]

Salary       0.089565
Age         -1.278386
Work_time    1.727164
Name: Mehmet, dtype: float64

In [33]:
newDataFrame.iloc[0]

Salary      -1.340001
Age         -0.431062
Work_time    0.831777
Name: Atil, dtype: float64

In [38]:
newDataFrame["Retirement"] = newDataFrame["Age"]*2

In [39]:
newDataFrame

          Salary       Age  Work_time  Retirement
Atil   -1.340001 -0.431062   0.831777   -0.862124
Zeynep -0.806902 -0.675433  -0.924507   -1.350866
Atlas   1.227286 -1.231177  -0.147297   -2.462354
Mehmet  0.089565 -1.278386   1.727164   -2.556771

In [40]:
newDataFrame.drop("Retirement",axis=1)

          Salary       Age  Work_time
Atil   -1.340001 -0.431062   0.831777
Zeynep -0.806902 -0.675433  -0.924507
Atlas   1.227286 -1.231177  -0.147297
Mehmet  0.089565 -1.278386   1.727164

In [41]:
newDataFrame.drop("Mehmet")

          Salary       Age  Work_time  Retirement
Atil   -1.340001 -0.431062   0.831777   -0.862124
Zeynep -0.806902 -0.675433  -0.924507   -1.350866
Atlas   1.227286 -1.231177  -0.147297   -2.462354

In [46]:
newDataFrame # no change

          Salary       Age  Work_time  Retirement
Atil   -1.340001 -0.431062   0.831777   -0.862124
Zeynep -0.806902 -0.675433  -0.924507   -1.350866
Atlas   1.227286 -1.231177  -0.147297   -2.462354
Mehmet  0.089565 -1.278386   1.727164   -2.556771

### inplace = True

In [47]:
newDataFrame.drop("Retirement",axis=1,inplace=True) #changed

In [48]:
newDataFrame

          Salary       Age  Work_time
Atil   -1.340001 -0.431062   0.831777
Zeynep -0.806902 -0.675433  -0.924507
Atlas   1.227286 -1.231177  -0.147297
Mehmet  0.089565 -1.278386   1.727164

In [50]:
newDataFrame.loc["Atil"]["Age"] #OR newDataFrame.loc["Atil","Age"]

-0.43106199534008677

In [53]:
newDataFrame[newDataFrame <0]

          Salary       Age  Work_time
Atil   -1.340001 -0.431062        NaN
Zeynep -0.806902 -0.675433  -0.924507
Atlas        NaN -1.231177  -0.147297
Mehmet       NaN -1.278386        NaN

In [55]:
newDataFrame[newDataFrame["Age"]>-1]

          Salary       Age  Work_time
Atil   -1.340001 -0.431062   0.831777
Zeynep -0.806902 -0.675433  -0.924507

## Change index

In [56]:
newDataFrame.reset_index()

    index    Salary       Age  Work_time
0    Atil -1.340001 -0.431062   0.831777
1  Zeynep -0.806902 -0.675433  -0.924507
2   Atlas  1.227286 -1.231177  -0.147297
3  Mehmet  0.089565 -1.278386   1.727164

In [57]:
newIndexList = ["Ati","Zey","Atl","Meh"]

In [59]:
newDataFrame["new index"] = newIndexList
newDataFrame

          Salary       Age  Work_time new index
Atil   -1.340001 -0.431062   0.831777       Ati
Zeynep -0.806902 -0.675433  -0.924507       Zey
Atlas   1.227286 -1.231177  -0.147297       Atl
Mehmet  0.089565 -1.278386   1.727164       Meh

In [61]:
newDataFrame.set_index("new index",inplace=True)

In [62]:
newDataFrame

             Salary       Age  Work_time
new index
Ati       -1.340001 -0.431062   0.831777
Zey       -0.806902 -0.675433  -0.924507
Atl        1.227286 -1.231177  -0.147297
Meh        0.089565 -1.278386   1.727164

## Multi Index

In [79]:
firstIndex = ["Simpson","Simpson","Simpson","South Park","South Park","South Park"]

In [80]:
innerIndex = ["Homer","Bart","Marge","Cartman","Kenny","Kyle"]

In [81]:
unitedIndex = list(zip(firstIndex,innerIndex))

In [82]:
unitedIndex

[('Simpson', 'Homer'),
 ('Simpson', 'Bart'),
 ('Simpson', 'Marge'),
 ('South Park', 'Cartman'),
 ('South Park', 'Kenny'),
 ('South Park', 'Kyle')]

In [83]:
unitedIndex = pd.MultiIndex.from_tuples(unitedIndex)

In [84]:
unitedIndex

MultiIndex([(   'Simpson',   'Homer'),
            (   'Simpson',    'Bart'),
            (   'Simpson',   'Marge'),
            ('South Park', 'Cartman'),
            ('South Park',   'Kenny'),
            ('South Park',    'Kyle')],
           )

In [85]:
cartoonList = [[40,"A"],[10,"B"],[30,"C"],[9,"D"],[10,"E"],[11,"F"]]

In [86]:
cartoonNumpyArray = np.array(cartoonList)

In [87]:
cartoonDataFrame = pd.DataFrame(cartoonNumpyArray,index=unitedIndex,columns=["Age","Job"])

In [88]:
cartoonDataFrame

                   Age Job
Simpson    Homer    40   A
           Bart     10   B
           Marge    30   C
South Park Cartman   9   D
           Kenny    10   E
           Kyle     11   F

In [89]:
cartoonDataFrame.loc["Simpson"]

      Age Job
Homer  40   A
Bart   10   B
Marge  30   C

In [95]:
cartoonDataFrame.loc["Simpson"].loc["Homer"] #OR loc["Simpson","Homer"]

Age    40
Job     A
Name: Homer, dtype: object

In [96]:
cartoonDataFrame

                   Age Job
Simpson    Homer    40   A
           Bart     10   B
           Marge    30   C
South Park Cartman   9   D
           Kenny    10   E
           Kyle     11   F

In [99]:
cartoonDataFrame.index.names= ["Cartoon","Name"]

In [100]:
cartoonDataFrame

                   Age Job
Cartoon    Name
Simpson    Homer    40   A
           Bart     10   B
           Marge    30   C
South Park Cartman   9   D
           Kenny    10   E
           Kyle     11   F